Revit 2024 API
ViewSheetSet Class
Represents ViewSheetSets stored in a document. ViewSheetSets can be stored so that the same printing task can be executed multiple times.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ViewSheetSet : Element,
	IViewSheetSet
Visual Basic
Public Class ViewSheetSet _
	Inherits Element _
	Implements IViewSheetSet
Visual C++
public ref class ViewSheetSet : public Element,
	IViewSheetSet
Remarks
 For the in-session ViewSheetSet, see the class InSessionViewSheetSet. Changes of ViewSheetSet would be effiective after [!:Autodesk::Revit::DB::ViewSheetSetting::Save]
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ViewSheetSet
See Also
ViewSheetSet Members
Autodesk.Revit.DB Namespace